# Learning Objectives

1. Performing boolean operations
2. Cascaded conditions
3. `.query()` method for filtering

In [1]:
import numpy as np
import pandas as pd

In [2]:
##creating a dataframe using dictionary with two Toms
scores_data = {"Student": ["Tom", "Katey", "Mak", "Bill", "Tom", "Rahul"],
               "Age": np.random.randint(20, 25, size=6),
               "Sub1_Score": np.random.randint(40, 100, size=6),
               "Sub2_Score": np.random.randint(40, 100, size=6),
               "Sub3_Score": np.random.randint(40, 100, size=6)
              }

scores_df = pd.DataFrame(scores_data)
scores_df

  Student  Age  Sub1_Score  Sub2_Score  Sub3_Score
0     Tom   21          90          85          67
1   Katey   24          96          96          96
2     Mak   24          67          97          47
3    Bill   22          55          45          83
4     Tom   23          88          58          87
5   Rahul   22          74          62          83

## Performing boolean operations

In [3]:
scores_df['Sub2_Score'] > 50

0     True
1     True
2     True
3    False
4     True
5     True
Name: Sub2_Score, dtype: bool

In [5]:
scores_df[scores_df['Sub2_Score'] < 50]

  Student  Age  Sub1_Score  Sub2_Score  Sub3_Score
3    Bill   22          55          45          83

In [6]:
scores_df[scores_df['Student'] == 'Tom']

  Student  Age  Sub1_Score  Sub2_Score  Sub3_Score
0     Tom   21          90          85          67
4     Tom   23          88          58          87

## Cascaded conditions

In [7]:
scores_df[(scores_df['Sub2_Score'] > 80) & (scores_df['Sub3_Score'] > 80)]

  Student  Age  Sub1_Score  Sub2_Score  Sub3_Score
1   Katey   24          96          96          96

In [8]:
scores_df[(scores_df['Sub2_Score'] > 80) | (scores_df['Sub3_Score'] > 80)]

  Student  Age  Sub1_Score  Sub2_Score  Sub3_Score
0     Tom   21          90          85          67
1   Katey   24          96          96          96
2     Mak   24          67          97          47
3    Bill   22          55          45          83
4     Tom   23          88          58          87
5   Rahul   22          74          62          83

## `query()` method for filtering

In [9]:
scores_df.query('Student == "Tom"')

  Student  Age  Sub1_Score  Sub2_Score  Sub3_Score
0     Tom   21          90          85          67
4     Tom   23          88          58          87

In [10]:
scores_df.query('Sub1_Score == Sub2_Score')

  Student  Age  Sub1_Score  Sub2_Score  Sub3_Score
1   Katey   24          96          96          96

In [11]:
scores_df.query('Sub1_Score >= 80 & Sub2_Score >= 80')

  Student  Age  Sub1_Score  Sub2_Score  Sub3_Score
0     Tom   21          90          85          67
1   Katey   24          96          96          96